:PROPERTIES:
:ID:       b3049366-b5ce-4caa-881f-e76663df2e12
:END:
#+title: Anki: Linux
#+date: "2021-05-01 20:20:25 +08:00"
#+date_modified: "2021-05-12 14:28:29 +08:00"
#+language: en
#+property: anki_deck Linux

** Back
#+begin_src shell
# Format the string.
printf "%s\n" foo bar 'baz ;;'

# Echo the string as-is.
echo "foo
bar
baz ;;"

# Print with escaped newlines.
echo -e "foo\nbar\nbaz ;;"
#+end_src

#+results:
: foo
: bar
: baz ;;
: foo
: bar
: baz ;;
: foo
: bar
: baz ;;

** Back
:PROPERTIES:
:ID:       a118fdec-8026-433b-9a58-b738183be7a2
:END:
Every 4 days, starting from the 8th of the month.

Assuming this was executed on 2021-05-12.

#+begin_src shell
systemd-analyze calendar *-*-8/4
#+end_src

#+results:
:   Original form: *-*-8/4
: Normalized form: *-*-08/4 00:00:00
:     Next elapse: Sun 2021-05-16 00:00:00 PST
:        (in UTC): Sat 2021-05-15 16:00:00 UTC
:        From now: 3 days left
